upnp-dlna-player/src/main/resources/soap/SetVolume.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
        <u:SetVolume xmlns:u="urn:schemas-upnp-org:service:RenderingControl:1">
            <InstanceID>0</InstanceID>
            <Channel>Master</Channel>
            <DesiredVolume>$volume</DesiredVolume>
        </u:SetVolume>
    </s:Body>
</s:Envelope>